In [192]:
import pandas as pd
import numpy as np

In [193]:
# 1D array
data = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [194]:
# 2 Convert pandas to List
lst = data.to_list()
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [195]:
# 3 Add, Subtract, Multiply and Divide two pandas series
s1 = pd.Series([2, 4, 6, 8, 10])
s2 = pd.Series([1, 3, 5, 7, 9])
print(f'Addition of s1 + s2 : \n{s1 + s2}\n')
print(f'Subtraction of s1 - s2 : \n{s1 - s2}\n')
print(f'Multiplication of s1 x s2 : \n{s1 * s2}\n')
print(f'division of s1 / s2 : \n{s1 // s2}\n')

Addition of s1 + s2 :
0     3
1     7
2    11
3    15
4    19
dtype: int64

Subtraction of s1 - s2 :
0    1
1    1
2    1
3    1
4    1
dtype: int64

Multiplication of s1 x s2 :
0     2
1    12
2    30
3    56
4    90
dtype: int64

division of s1 / s2 :
0    2
1    1
2    1
3    1
4    1
dtype: int64

In [196]:
# 4 Powers of array values element-wise
s1 = pd.Series([0, 1, 2, 3, 4, 5, 6])
s2 = pd.Series([3, 3, 3, 3, 3, 3, 3])
print(s1 ** s2)

0      0
1      1
2      8
3     27
4     64
5    125
6    216
dtype: int64

In [197]:
# 5 Dictionary ot pandas
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index=labels)
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [198]:
# 6 Summary of given data
data = pd.DataFrame(exam_data, index=labels)
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [199]:
# 7 Print first three rows of data
data = pd.DataFrame(exam_data, index=labels)
data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [200]:
# 8 Display specified attributes
data = pd.DataFrame(exam_data, index=labels)
data[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [201]:
# 9 Select specified columns and rows from the given dataframe
data = pd.DataFrame(exam_data, index=labels)
data.loc[['b', 'd', 'f', 'g'], ['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [202]:
# 10 Select rows where number of attempts is greater than 2
data = pd.DataFrame(exam_data, index=labels)
data[data['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [203]:
# 11 Count Number of rows and columns
rows, cols = data.shape
print(f"rows: {rows}")
print(f"cols: {cols}")

rows: 10
cols: 4

In [204]:
# 12 Select row where score is missing
data[data['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [205]:
# 13 Select rows score > 15 and attempts < 2
data[(data['attempts'] < 2) & (data['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [206]:
# 14 Change score row 'd' to 11.5
data.loc['d', 'score'] = 11.5
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [207]:
# 15 Sum of examination attempt by the students
data['attempts'].sum()

np.int64(19)

In [208]:
# 16 Mean score for given data frame
data['score'].mean()

np.float64(13.333333333333334)

In [209]:
# 17 Added new row to the given dataframe
data.loc['k'] = {'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [210]:
# 18 Sort dataframe by name in descending order and by score in ascending order
data.sort_values(by=['name', 'score'],ascending=[False, True])

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [211]:
# 19 Replace the 'qualify' column values 'yes' and 'no' with 'True' and 'False'
data['qualify'] = data['qualify'].apply(lambda x: True if x == 'yes' else False)
# data['qualify'] = data['qualify'].replace({'yes': True, 'no': False})
data

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k     Suresh   15.5         1     True

In [212]:
# 20 Delete a column 'attempts' from dataframe
data.drop('attempts', axis = 1, inplace=True)
data

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k     Suresh   15.5     True

In [213]:
# 21 Add a new column to the existing dataframe
data['attempts'] = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1, 1]
data

        name  score  qualify  attempts
a  Anastasia   12.5     True         1
b       Dima    9.0    False         3
c  Katherine   16.5     True         2
d      James   11.5    False         3
e      Emily    9.0    False         2
f    Michael   20.0     True         3
g    Matthew   14.5     True         1
h      Laura    NaN    False         1
i      Kevin    8.0    False         2
j      Jonas   19.0     True         1
k     Suresh   15.5     True         1

In [214]:
# 22 Iterate over dataframe
print(f"   {'Name':10s} {'score':5s} {'qualify':7s} {'attempts'}\n")
for index, row in data.iterrows():
    print(f"{index:2s} {row['name']:10s} {row['score']:5.2f} {'True' if row['qualify'] else 'False':>7s} {row['attempts']:>2d}\n")

   Name       score qualify attempts

a  Anastasia  12.50    True  1

b  Dima        9.00   False  3

c  Katherine  16.50    True  2

d  James      11.50   False  3

e  Emily       9.00   False  2

f  Michael    20.00    True  3

g  Matthew    14.50    True  1

h  Laura        nan   False  1

i  Kevin       8.00   False  2

j  Jonas      19.00    True  1

k  Suresh     15.50    True  1

In [215]:
# 23 List of column headers
header = data.columns
header

Index(['name', 'score', 'qualify', 'attempts'], dtype='object')